w04/d02/squares_app/app/controllers/squares_controller.rb

  def index
    @squares = Square.all
---
SELECT "squares".* FROM "squares"

  def create
    new_square = Square.create( params.require(:square).permit(:side_length, :border_radius, :color) )
---
INSERT INTO "squares" ("border_radius", "color", "created_at", "side_length", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["border_radius", 50], ["color", "blue"], ["created_at", "2014-05-10 02:18:32.653681"], ["side_length", 20], ["updated_at", "2014-05-10 02:18:32.653681"]]

  def show
    @square = Square.find(params[:id])
---
SELECT  "squares".* FROM "squares"  WHERE "squares"."id" = $1 LIMIT 1  [["id", 2]]

  def edit
    @square = Square.find(params[:id])
---
SELECT  "squares".* FROM "squares"  WHERE "squares"."id" = $1 LIMIT 1  [["id", 3]]

  def update
     edited_square = Square.find(params[:id])
     new_square = Square.create( params.require(:square).permit(:side_length, :border_radius, :color) )
---
SELECT  "squares".* FROM "squares"  WHERE "squares"."id" = $1 LIMIT 1  [["id", 3]]
INSERT INTO "squares" ("border_radius", "color", "created_at", "side_length", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["border_radius", 20], ["color", "yellow"], ["created_at", "2014-05-10 02:26:59.348337"], ["side_length", 20], ["updated_at", "2014-05-10 02:26:59.348337"]]

  def destroy
    Square.delete(params[:id])
---
DELETE FROM "squares" WHERE "squares"."id" = 2