w03/d04/a-proto/app/controllers/protos_controller.rb

SELECT "protos".* FROM "protos"
---
  def index
    @protos = Proto.all

SELECT  "protos".* FROM "protos"  WHERE "protos"."id" = $1 LIMIT 1  [["id", 2]]
---
  def show
    @proto = Proto.find(params[:id])